#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/virtuosity/testprod-demo/runs/run-v91CGfXKF91LqAa5

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
data.alicloud_images.default: Refreshing...
data.alicloud_images.default: Refresh complete after 3s [id=924610970]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # alicloud_instance.ecs_instance_prod_1 will be created
  + resource "alicloud_instance" "ecs_instance_prod_1" {
      + availability_zone                  = (known after apply)
      + credit_specification               = (known after apply)
      + deletion_protection                = false
      + deployment_set_group_no            = (known after apply)
      + dry_run                            = false
      + host_name                          = (known after apply)
      + http_endpoint                      = (known after apply)
      + http_put_response_hop_limit        = (known after apply)
      + http_tokens                        = (known after apply)
      + id                                 = (known after apply)
      + image_id                           = "ubuntu_22_04_x64_20G_alibase_20230208.vhd"
      + instance_charge_type               = "PostPaid"
      + instance_name                      = "ecs-instance-demo"
      + instance_type                      = "ecs.n4.large"
      + internet_charge_type               = "PayByTraffic"
      + internet_max_bandwidth_in          = (known after apply)
      + internet_max_bandwidth_out         = 10
      + ipv6_address_count                 = (known after apply)
      + ipv6_addresses                     = (known after apply)
      + key_name                           = (known after apply)
      + maintenance_action                 = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + role_name                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ips              = (known after apply)
      + security_groups                    = (known after apply)
      + spot_duration                      = (known after apply)
      + spot_strategy                      = "NoSpot"
      + status                             = (known after apply)
      + stopped_mode                       = (known after apply)
      + subnet_id                          = (known after apply)
      + system_disk_category               = "cloud_efficiency"
      + system_disk_description            = "System Disk for ECS"
      + system_disk_name                   = "ecs-system-disk"
      + system_disk_performance_level      = (known after apply)
      + system_disk_size                   = 80
      + volume_tags                        = (known after apply)
      + vswitch_id                         = (known after apply)
    }

  # alicloud_security_group.sec_group will be created
  + resource "alicloud_security_group" "sec_group" {
      + description         = "foo"
      + id                  = (known after apply)
      + inner_access        = (known after apply)
      + inner_access_policy = (known after apply)
      + name                = "sec-group-demo"
      + security_group_type = "normal"
      + vpc_id              = (known after apply)
    }

  # alicloud_vpc.vpc_prod will be created
  + resource "alicloud_vpc" "vpc_prod" {
      + cidr_block            = "172.16.0.0/16"
      + id                    = (known after apply)
      + ipv6_cidr_block       = (known after apply)
      + name                  = (known after apply)
      + resource_group_id     = (known after apply)
      + route_table_id        = (known after apply)
      + router_id             = (known after apply)
      + router_table_id       = (known after apply)
      + secondary_cidr_blocks = (known after apply)
      + status                = (known after apply)
      + vpc_name              = "VPC-Prod-Demo"
    }

  # alicloud_vswitch.vswitch_prod will be created
  + resource "alicloud_vswitch" "vswitch_prod" {
      + availability_zone = (known after apply)
      + cidr_block        = "172.16.1.0/24"
      + id                = (known after apply)
      + name              = (known after apply)
      + status            = (known after apply)
      + vpc_id            = (known after apply)
      + vswitch_name      = "vswitch-demo"
      + zone_id           = "ap-southeast-3a"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alicloud_ecs_instance_id = (known after apply)
  + alicloud_vpc_id          = (known after apply)
  + alicloud_vswitch_id      = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

------------------------------------------------------------------------

Organization Policy Check:

================ Results for policy set: <empty policy set name> ===============

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

1 policies evaluated.

## Policy 1: test-policy (hard-mandatory)

Result: true

./test-policy.sentinel:46:1 - Rule "main"
  Description:
    Main rule that requires other rules to be true

  Value:
    true

./test-policy.sentinel:35:1 - Rule "instance_type_allowed"
  Description:
    Rule to restrict instance types

  Value:
    true

./test-policy.sentinel:41:1 - Rule "resource_limit"
  Value:
    true



```
</details>
*Pushed by: @aaronkvirts, Action: `pull_request`*